exp_roomWT/nv_windAroundBuildings/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    building
    {
        type            wall;
        physicalType    wall;
        nFaces          1220;
        startFace       10234;
    }
    inlet
    {
        type            patch;
        physicalType    patch;
        nFaces          50;
        startFace       11454;
    }
    outlet
    {
        type            patch;
        physicalType    patch;
        nFaces          50;
        startFace       11504;
    }
    wtwalls
    {
        type            wall;
        physicalType    wall;
        nFaces          416;
        startFace       11554;
    }
    defaultFaces
    {
        type            wall;
        nFaces          244;
        startFace       11970;
    }
)

// ************************************************************************* //
